<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>软件测试简介 | GYF1</title>
  <meta name="author" content="GYF1">
  
  <meta name="description" content="郭银锋 | 程序员 | JavaScript | CSS">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="软件测试简介"/>
  <meta property="og:site_name" content="GYF1"/>

  
    <meta property="og:image" content="undefined"/>
  

  <!--<meta name="baidu-site-verification" content="ZDIDoHeMEZ" />-->
  <!--<meta name="baidu_union_verify" content="579c32c6acaf563a65fed2fa8575ebd3">-->

  <!-- <link href="/favicon.png" rel="icon"> -->
  <link href="/favicon.ico" rel="icon" type="image/x-ico">


  <link rel="alternate" href="/atom.xml" title="GYF1" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  
</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">GYF1</a></h1>
  <h2><a href="/">Web Platform, Cloud and Mobile Application Development</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">存档</a></li>
    
      <li><a href="/atom.xml">RSS</a></li>
    
      <li><a href="/bookmark">Bookmark</a></li>
    
      <li><a href="http://gyf1.com">GYF1</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div></header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2014-04-20T09:51:53.000Z"><a href="/2014/04/20/软件测试简介/">4月 20 2014</a></time>
      
      
  
    <h1 class="title">软件测试简介</h1>
  

    </header>
    <div class="entry">
      
        <p>&#x6D4B;&#x8BD5;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF01;<br>&#x4E00;&#x4E2A;&#x5408;&#x683C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x5E94;&#x8BE5;&#x4EC5;&#x7B80;&#x5355;&#x8FFD;&#x6C42;&#x529F;&#x80FD;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x786E;&#x4FDD;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x7A33;&#x5B9A;&#x3002;<br>&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6D4B;&#x8BD5;&#x3002;<br>&#x6309;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x9636;&#x6BB5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x6709;&#xFF1A;<br>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;<br>&#x8FD8;&#x6709;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x5148;&#x4E0D;&#x6D89;&#x53CA;<br><a id="more"></a></p>
<h1 id="&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;">&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</h1>
<p>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x662F;&#x96C6;&#x4E2D;&#x5BF9;&#x7528;&#x6E90;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x68C0;&#x67E5;&#x5404;&#x4E2A;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#x662F;&#x5426;&#x6B63;&#x786E;&#x5730;&#x5B9E;&#x73B0;&#x4E86;&#x89C4;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x3002;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x628A;&#x5DF2;&#x6D4B;&#x8BD5;&#x8FC7;&#x7684;&#x6A21;&#x5757;&#x7EC4;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x4E3B;&#x8981;&#x5BF9;&#x4E0E;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x7684;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6784;&#x9020;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x628A;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7;&#x786E;&#x8BA4;&#x7684;&#x8F6F;&#x4EF6;&#x7EB3;&#x5165;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4E0E;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x6210;&#x4EFD;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x5355;&#x5143;&#x6D4B;&#x8BD5;_(Unit_Testing)">&#x5355;&#x5143;&#x6D4B;&#x8BD5; (Unit Testing)</h2>
<p>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x53C8;&#x79F0;&#x6A21;&#x5757;&#x6D4B;&#x8BD5;&#xFF0C;&#x662F;&#x9488;&#x5BF9;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D; &#x2500; &#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#xFF0C;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x6027;&#x68C0;&#x9A8C;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x3002;&#x5176;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x53D1;&#x73B0;&#x5404;&#x6A21;&#x5757;&#x5185;&#x90E8;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x5404;&#x79CD;&#x5DEE;&#x9519;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x9700;&#x8981;&#x4ECE;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x51FA;&#x53D1;&#x8BBE;&#x8BA1;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x3002;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x5E73;&#x884C;&#x5730;&#x72EC;&#x7ACB;&#x8FDB;&#x884C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF08;Integrated_Testing&#xFF09;">&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF08;Integrated Testing&#xFF09;</h2>
<p>&#x901A;&#x5E38;&#xFF0C;&#x5728;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x6240;&#x6709;&#x6A21;&#x5757;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x7EC4;&#x88C5;&#x6210;&#x4E3A;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x65F6;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;<br>    &#x2013; &#x5728;&#x628A;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x65F6;&#x4FAF;&#xFF0C;&#x7A7F;&#x8D8A;&#x6A21;&#x5757;&#x63A5;&#x53E3;&#x7684;&#x6570;&#x636E;&#x662F;&#x5426;&#x4F1A;&#x4E22;&#x5931;&#xFF1B;<br>    &#x2013; &#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x529F;&#x80FD;&#x662F;&#x5426;&#x4F1A;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x529F;&#x80FD;&#x4EA7;&#x751F;&#x4E0D;&#x5229;&#x7684;&#x5F71;&#x54CD;&#xFF1B;<br>    &#x2013; &#x5404;&#x4E2A;&#x5B50;&#x529F;&#x80FD;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x80FD;&#x5426;&#x8FBE;&#x5230;&#x9884;&#x671F;&#x8981;&#x6C42;&#x7684;&#x7236;&#x529F;&#x80FD;&#xFF1B;<br>    &#x2013; &#x5168;&#x5C40;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x5426;&#x6709;&#x95EE;&#x9898;&#xFF1B;<br>    &#x2013; &#x5355;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x8BEF;&#x5DEE;&#x7D2F;&#x79EF;&#x8D77;&#x6765;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x653E;&#x5927;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#x7A0B;&#x5EA6;&#x3002;<br>&#x5728;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x540C;&#x65F6;&#x53EF;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF0C;&#x53D1;&#x73B0;&#x5E76;&#x6392;&#x9664;&#x5728;&#x6A21;&#x5757;&#x8FDE;&#x63A5;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7EC8;&#x6784;&#x6210;&#x8981;&#x6C42;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x7279;&#x522B;&#x79F0;&#x4E3A;&#x90E8;&#x4EF6;&#x6D4B;&#x8BD5;&#xFF0C;&#x5B83;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x8981;&#x627E;&#x51FA;&#x96C6;&#x6210;&#x540E;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x4E0E;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x8BF4;&#x660E;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p>
<h2 id="&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF08;System_Testing&#xFF09;">&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF08;System Testing&#xFF09;</h2>
<p>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF0C;&#x662F;&#x5C06;&#x901A;&#x8FC7;&#x786E;&#x8BA4;&#x6D4B;&#x8BD5;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F5C;&#x4E3A;&#x6574;&#x4E2A;&#x57FA;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x3001;&#x5916;&#x8BBE;&#x3001;&#x67D0;&#x4E9B;&#x652F;&#x6301;&#x8F6F;&#x4EF6;&#x3001;&#x6570;&#x636E;&#x548C;&#x4EBA;&#x5458;&#x7B49;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x5143;&#x7D20;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7EC4;&#x88C5;&#x6D4B;&#x8BD5;&#x548C;&#x786E;&#x8BA4;&#x6D4B;&#x8BD5;&#x3002;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x901A;&#x8FC7;&#x4E0E;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x6C42;&#x5B9A;&#x4E49;&#x4F5C;&#x6BD4;&#x8F83;, &#x53D1;&#x73B0;&#x8F6F;&#x4EF6;&#x4E0E;&#x7CFB;&#x7EDF;&#x7684;&#x5B9A;&#x4E49;&#x4E0D;&#x7B26;&#x5408;&#x6216;&#x4E0E;&#x4E4B;&#x77DB;&#x76FE;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF1A;<br>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x662F;&#x5BF9;&#x8F6F;&#x4EF6;&#x57FA;&#x672C;&#x7EC4;&#x6210;&#x5355;&#x5143;&#xFF08;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF09;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x6027;&#x68C0;&#x9A8C;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x51FD;&#x6570;&#x3001;&#x8FC7;&#x7A0B;(function,procedure)&#x6216;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;(method)&#x3002;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF1A;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x662F;&#x5728;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x6A21;&#x5757;&#x6309;&#x7167;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x7EC4;&#x88C5;&#x6210;&#x4E3A;&#x5B50;&#x7CFB;&#x7EDF;&#x6216;&#x7CFB;&#x7EDF;&#xFF0C;&#x9A8C;&#x8BC1;&#x7EC4;&#x88C5;&#x540E;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x6A21;&#x5757;&#x95F4;&#x63A5;&#x53E3;&#x662F;&#x5426;&#x6B63;&#x786E;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x3002;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x4E5F;&#x53EB;&#x7EC4;&#x88C5;&#x6D4B;&#x8BD5;&#x3001;&#x8054;&#x5408;&#x6D4B;&#x8BD5;&#x3001;&#x5B50;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x6216;&#x90E8;&#x4EF6;&#x6D4B;&#x8BD5;&#x3002;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF1A;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x662F;&#x5C06;&#x5DF2;&#x7ECF;&#x96C6;&#x6210;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F5C;&#x4E3A;&#x6574;&#x4E2A;&#x57FA;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x3001;&#x5916;&#x8BBE;&#x3001;&#x67D0;&#x4E9B;&#x652F;&#x6301;&#x8F6F;&#x4EF6;&#x3001;&#x6570;&#x636E;&#x548C;&#x4EBA;&#x5458;&#x7B49;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x5143;&#x7D20;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7EC4;&#x88C5;&#x6D4B;&#x8BD5;&#x548C;&#x786E;&#x8BA4;&#x6D4B;&#x8BD5;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<h1 id="&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;">&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;</h1>
<p>&#x9996;&#x5148;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#x4E0D;&#x540C;&#xFF1A;<br>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5C5E;&#x4E8E;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;&#xFF1B;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x5C5E;&#x4E8E;&#x7070;&#x76D2;&#x6D4B;&#x8BD5;&#x7684;&#x8303;&#x7574;&#xFF1B;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x5C5E;&#x4E8E;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x8003;&#x5BDF;&#x8303;&#x56F4;&#x4E0D;&#x540C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x6D4B;&#x8BD5;&#x7684;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#xFF1A;<br>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4E3B;&#x8981;&#x6D4B;&#x8BD5;&#x5355;&#x5143;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3001;&#x903B;&#x8F91;&#x63A7;&#x5236;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7B49;&#x7B49;&#xFF1B;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x4E3B;&#x8981;&#x6D4B;&#x8BD5;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x63A5;&#x53E3;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x53CA;&#x6A21;&#x5757;&#x7EC4;&#x5408;&#x540E;&#x7684;&#x6574;&#x4F53;&#x529F;&#x80FD;&#xFF1B;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x4E3B;&#x8981;&#x6D4B;&#x8BD5;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x76F8;&#x5BF9;&#x4E8E;&#x9700;&#x6C42;&#x7684;&#x7B26;&#x5408;&#x5EA6;&#x3002;</p>
<p>&#x518D;&#x6B21;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x57FA;&#x51C6;&#x4E0D;&#x540C;&#xFF1A;<br>&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x8BC4;&#x4F30;&#x7684;&#x4E3B;&#x8981;&#x662F;&#x903B;&#x8F91;&#x8986;&#x76D6;&#x7387;&#xFF1B;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#x8BC4;&#x4F30;&#x7684;&#x4E3B;&#x8981;&#x662F;&#x63A5;&#x53E3;&#x8986;&#x76D6;&#x7387;&#xFF1B;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x8BC4;&#x4F30;&#x7684;&#x662F;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x5BF9;&#x9700;&#x6C42;&#x89C4;&#x683C;&#x7684;&#x8986;&#x76D6;&#x7387;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x9636;&#x6BB5; &#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;  &#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;                                     &#x8BC4;&#x4F30;&#x57FA;&#x51C6;&#x5BF9;&#x5E94;&#x9636;&#x6BB5;<br>&#x5355;&#x5143;&#x6D4B;&#x8BD5; &#x767D;&#x76D2;&#x6D4B;&#x8BD5;  &#x5355;&#x5143;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x903B;&#x8F91;&#x63A7;&#x5236;&#xFF0C;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7B49;          &#x903B;&#x8F91;&#x8986;&#x76D6;&#x7387; &#x8BE6;&#x8BBE;<br>&#x96C6;&#x6210;&#x6D4B;&#x8BD5; &#x7070;&#x76D2;&#x6D4B;&#x8BD5;  &#x6A21;&#x5757;&#x95F4;&#x63A5;&#x53E3;&#x4EE5;&#x53CA;&#x6A21;&#x5757;&#x7EC4;&#x5408;&#x540E;&#x7684;&#x6574;&#x4F53;&#x529F;&#x80FD;               &#x63A5;&#x53E3;&#x8986;&#x76D6;&#x7387; &#x6982;&#x8BBE;<br>&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5; &#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;  &#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5BF9;&#x9700;&#x6C42;&#x7684;&#x7B26;&#x5408;&#x5EA6;                         &#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x5BF9;&#x9700;&#x6C42;&#x7684;&#x8986;&#x76D6;&#x7387; &#x9700;&#x6C42;</p>
<h1 id="&#x53C2;&#x8003;">&#x53C2;&#x8003;</h1>
<p><a href="http://blog.itpub.net/12639375/viewspace-160047/" target="_blank" rel="external">http://blog.itpub.net/12639375/viewspace-160047/</a><br><a href="http://blog.itpub.net/12639375/viewspace-160048/" target="_blank" rel="external">http://blog.itpub.net/12639375/viewspace-160048/</a><br><a href="http://blog.sina.com.cn/s/blog_937881ba0100v0wp.html" target="_blank" rel="external">http://blog.sina.com.cn/s/blog_937881ba0100v0wp.html</a></p>

      
    </div>
    <footer>
      
        
  
  <div class="categories">
    <a href="/categories/software-engineering/">Software Engineering</a>
  </div>

        
        <div class="bdsharebuttonbox"><a href="#" class="bds_more" data-cmd="more"></a><a title="分享到新浪微博" href="#" class="bds_tsina" data-cmd="tsina"></a><a title="分享到微信" href="#" class="bds_weixin" data-cmd="weixin"></a><a title="分享到QQ空间" href="#" class="bds_qzone" data-cmd="qzone"></a><a title="分享到腾讯微博" href="#" class="bds_tqq" data-cmd="tqq"></a><a title="分享到人人网" href="#" class="bds_renren" data-cmd="renren"></a></div>
        <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"2","bdMiniList":false,"bdPic":"","bdStyle":"0","bdSize":"24"},"share":{},"image":{"viewList":["tsina","weixin","qzone","tqq","renren"],"viewText":"分享到：","viewSize":"16"},"selectShare":{"bdContainerClass":null,"bdSelectMiniList":["tsina","weixin","qzone","tqq","renren"]}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>
        
<div class="prev_next clearfix">
  
    <a href="/2014/04/20/tdd-简介/" class="alignleft prev" title="TDD 简介">TDD 简介</a>
  
  
    <a href="/2014/04/20/yeoman-使用指南/" class="alignright next" title="Yeoman 使用指南">Yeoman 使用指南</a>
  
</div>

      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>


<section id="comment">
  <!-- <h1 class="title">留言</h1>

  
      <div id="fb-root"></div>
<script>
  (function(d, s, id) {
    var js, fjs = d.getElementsByTagName(s)[0];
    if (d.getElementById(id)) return;
    js = d.createElement(s); js.id = id;
    js.src = "//connect.facebook.net/en_US/all.js#xfbml=1&appId=123456789012345";
    fjs.parentNode.insertBefore(js, fjs);
  }(document, 'script', 'facebook-jssdk'));
</script>

<div class="fb-comments" data-href="http://blog.gyf1.com/2014/04/20/软件测试简介/" data-num-posts="5" data-width="840" data-colorscheme="light"></div>
      
   -->

  <!-- Duoshuo Comment BEGIN -->
  <div class="ds-thread"></div>
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"gyf"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = 'http://static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0] 
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
    </script>
  <!-- Duoshuo Comment END -->
</section>
</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:blog.gyf1.com">
  </form>
</div>

  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/cloud/">Cloud</a><small>5</small></li>
  
    <li><a href="/categories/database/">Database</a><small>8</small></li>
  
    <li><a href="/categories/giant/">Giant</a><small>96</small></li>
  
    <li><a href="/categories/html/">HTML</a><small>11</small></li>
  
    <li><a href="/categories/innovation/">Innovation</a><small>2</small></li>
  
    <li><a href="/categories/javascript/">JavaScript</a><small>82</small></li>
  
    <li><a href="/categories/mobile/">Mobile</a><small>6</small></li>
  
    <li><a href="/categories/others/">Others</a><small>10</small></li>
  
    <li><a href="/categories/portfolio/">Portfolio</a><small>7</small></li>
  
    <li><a href="/categories/salesforce/">Salesforce</a><small>9</small></li>
  
    <li><a href="/categories/software-engineering/">Software Engineering</a><small>20</small></li>
  
    <li><a href="/categories/style/">Style</a><small>26</small></li>
  
  </ul>
</div>


  
<div class="widget tagcloud">
  <h3 class="title">标签云</h3>
  <div class="entry">
    <a href="/tags/agile-development/" style="font-size: 12.50px;">Agile Development</a><a href="/tags/android/" style="font-size: 10.00px;">Android</a><a href="/tags/angularjs/" style="font-size: 20.00px;">AngularJS</a><a href="/tags/apex/" style="font-size: 11.67px;">Apex</a><a href="/tags/bootstrap/" style="font-size: 14.17px;">Bootstrap</a><a href="/tags/bower/" style="font-size: 10.83px;">Bower</a><a href="/tags/css/" style="font-size: 18.33px;">CSS</a><a href="/tags/certification/" style="font-size: 10.83px;">Certification</a><a href="/tags/coffeescript/" style="font-size: 10.83px;">CoffeeScript</a><a href="/tags/commonjs/" style="font-size: 10.00px;">CommonJS</a><a href="/tags/compass/" style="font-size: 10.00px;">Compass</a><a href="/tags/design-pattern/" style="font-size: 15.83px;">Design Pattern</a><a href="/tags/dojo/" style="font-size: 10.00px;">Dojo</a><a href="/tags/english/" style="font-size: 10.83px;">English</a><a href="/tags/express/" style="font-size: 10.00px;">Express</a><a href="/tags/geddy/" style="font-size: 10.00px;">Geddy</a><a href="/tags/git/" style="font-size: 10.83px;">Git</a><a href="/tags/golang/" style="font-size: 10.00px;">Golang</a><a href="/tags/grunt/" style="font-size: 12.50px;">Grunt</a><a href="/tags/gulp/" style="font-size: 10.00px;">Gulp</a><a href="/tags/html5/" style="font-size: 13.33px;">HTML5</a><a href="/tags/haxe/" style="font-size: 10.00px;">Haxe</a><a href="/tags/heroku/" style="font-size: 12.50px;">Heroku</a><a href="/tags/ionic/" style="font-size: 15.00px;">Ionic</a><a href="/tags/jshint/" style="font-size: 10.83px;">JSHint</a><a href="/tags/jasmine/" style="font-size: 10.00px;">Jasmine</a><a href="/tags/karma/" style="font-size: 10.83px;">Karma</a><a href="/tags/less/" style="font-size: 10.00px;">LESS</a><a href="/tags/learning/" style="font-size: 19.17px;">Learning</a><a href="/tags/memcache/" style="font-size: 10.00px;">Memcache</a><a href="/tags/meteor/" style="font-size: 12.50px;">Meteor</a><a href="/tags/mongodb/" style="font-size: 14.17px;">MongoDB</a><a href="/tags/mongoose/" style="font-size: 10.83px;">Mongoose</a><a href="/tags/mootools/" style="font-size: 10.00px;">MooTools</a><a href="/tags/nodejs/" style="font-size: 17.50px;">Node.js</a><a href="/tags/phantomjs/" style="font-size: 10.00px;">Phantomjs</a><a href="/tags/postgres/" style="font-size: 10.00px;">Postgres</a><a href="/tags/protractor/" style="font-size: 10.00px;">Protractor</a><a href="/tags/ratchet/" style="font-size: 10.00px;">Ratchet</a><a href="/tags/redis/" style="font-size: 10.00px;">Redis</a><a href="/tags/regexp/" style="font-size: 10.83px;">RegExp</a><a href="/tags/requirejs/" style="font-size: 10.00px;">RequireJS</a><a href="/tags/riak/" style="font-size: 10.00px;">Riak</a><a href="/tags/sass/" style="font-size: 10.83px;">SASS</a><a href="/tags/stylus/" style="font-size: 10.00px;">Stylus</a><a href="/tags/teamcity/" style="font-size: 10.00px;">TeamCity</a><a href="/tags/titanium/" style="font-size: 10.00px;">Titanium</a><a href="/tags/translation/" style="font-size: 13.33px;">Translation</a><a href="/tags/ucd/" style="font-size: 10.00px;">UCD</a><a href="/tags/ued/" style="font-size: 10.00px;">UED</a><a href="/tags/visualforce/" style="font-size: 11.67px;">Visualforce</a><a href="/tags/webstorm/" style="font-size: 14.17px;">WebStorm</a><a href="/tags/yslow/" style="font-size: 10.00px;">YSlow</a><a href="/tags/yui/" style="font-size: 10.00px;">YUI</a><a href="/tags/yeoman/" style="font-size: 10.00px;">Yeoman</a><a href="/tags/jquery/" style="font-size: 16.67px;">jQuery</a>
  </div>
</div>


  
<div class="widget tag">
  <h3 class="title">最新文章</h3>
  <ul class="entry">
    
      <li>
        <a href="/2015/03/06/import-json-into-mongodb/">import json into mongodb</a>
      </li>
    
      <li>
        <a href="/2015/03/06/import-xml-file-into-mongodb/">import xml file into mongodb</a>
      </li>
    
      <li>
        <a href="/2015/03/06/2013-china-district-data/">2013年统计用区划代码和城乡划分代码</a>
      </li>
    
      <li>
        <a href="/2015/03/04/angularjs-controller-watch-service-variable/">angularjs controller watch service variable</a>
      </li>
    
      <li>
        <a href="/2015/03/03/ionic-html5-input-types/">ionic HTML5 Input Types</a>
      </li>
    
      <li>
        <a href="/2015/03/03/ionic-tabs-horizon-scroll/">ionic tabs horizon scroll</a>
      </li>
    
      <li>
        <a href="/2015/03/03/meteor-package-accounts-password/">meteor package accounts-password</a>
      </li>
    
      <li>
        <a href="/2015/03/02/ionic-quiz-app-design/">ionic quiz app design</a>
      </li>
    
      <li>
        <a href="/2015/02/27/meteor1/">meteor1</a>
      </li>
    
      <li>
        <a href="/2015/02/27/connect-to-a-remote-mongodb/">Connect to a Remote MongoDB</a>
      </li>
    
  </ul>
</div>


  <iframe 
	width="100%" 
	height="600" 
	class="share_self"  
	frameborder="0" 
	scrolling="no" 
	src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=0&speed=0&skin=5&isTitle=1&noborder=1&isWeibo=1&isFans=0&uid=3988939492&verifier=76ceba5c&dpc=1"
	>
</iframe>
</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2015 GYF1
  
</div>
<div class="clearfix"></div></footer>
  <script src="/js/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<div id="totop" style="position:fixed;bottom:150px;right:50px;cursor: pointer;">
<a title="返回顶部"><img src="/imgs/scrollup.png"/></a>
</div>
<script src="/js/totop.js"></script>

</body>
</html>