<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>jquery | GYF1</title>
  <meta name="author" content="GYF1">
  
  <meta name="description" content="郭银锋 | 程序员 | JavaScript | CSS">
  
  
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  <meta property="og:title" content="jquery"/>
  <meta property="og:site_name" content="GYF1"/>

  
    <meta property="og:image" content="undefined"/>
  

  <!--<meta name="baidu-site-verification" content="ZDIDoHeMEZ" />-->
  <!--<meta name="baidu_union_verify" content="579c32c6acaf563a65fed2fa8575ebd3">-->

  <!-- <link href="/favicon.png" rel="icon"> -->
  <link href="/favicon.ico" rel="icon" type="image/x-ico">


  <link rel="alternate" href="/atom.xml" title="GYF1" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  
</head>


<body>
  <header id="header" class="inner"><div class="alignleft">
  <h1><a href="/">GYF1</a></h1>
  <h2><a href="/">Web Platform, Cloud and Mobile Application Development</a></h2>
</div>
<nav id="main-nav" class="alignright">
  <ul>
    
      <li><a href="/">首页</a></li>
    
      <li><a href="/archives">存档</a></li>
    
      <li><a href="/atom.xml">RSS</a></li>
    
      <li><a href="https://github.com/guoyinfeng">GitHub</a></li>
    
      <li><a href="/note">Note</a></li>
    
      <li><a href="/thinking">Thinking</a></li>
    
      <li><a href="/bookmark">Bookmark</a></li>
    
      <li><a href="/about">关于</a></li>
    
  </ul>
  <div class="clearfix"></div>
</nav>
<div class="clearfix"></div></header>
  <div id="content" class="inner">
    <div id="main-col" class="alignleft"><div id="wrapper"><article class="post">
  
    <div class="gallery">
  <div class="photoset">
    
      <img src="">
    
  </div>
  <div class="control">
    <div class="prev"></div>
    <div class="next"></div>
  </div>
</div>
  
  <div class="post-content">
    <header>
      
        <div class="icon"></div>
        <time datetime="2014-04-13T01:31:26.000Z"><a href="/2014/04/13/教学邦-网校平台/">4月 13 2014</a></time>
      
      
  
    <h1 class="title">jquery</h1>
  

    </header>
    <div class="entry">
      
        <p>jquery</p>
<a id="more"></a>

<p>&#x6559;&#x5B66;&#x90A6;-&#x7F51;&#x6821;&#x5E73;&#x53F0;</p>
<p>&#x7F51;&#x6821;&#x548C;&#x516C;&#x5F00;&#x8BFE;&#x670D;&#x52A1;&#x7F51;&#x7AD9;&#x3002;<br>&#x7B80;&#x4ECB;&#xFF1A; &#x6559;&#x5B66;&#x90A6;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x6821;&#x548C;&#x516C;&#x5F00;&#x8BFE;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7F51;&#x6821;&#x521B;&#x5EFA;&#x548C;&#x5206;&#x9500;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#xFF0C;&#x96B6;&#x5C5E;&#x4E8E;&#x4E0A;&#x6D77;&#x79E6;&#x955C;&#x7F51;&#x7EDC;&#x79D1;&#x6280;&#x6709;&#x9650;&#x516C;&#x53F8;&#x3002;</p>
<h1 id="&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;">&#x4E00;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;</h1>
<h2 id="1-1_&#x673A;&#x6784;">1.1 &#x673A;&#x6784;</h2>
<h3 id="1-1-1_&#x57F9;&#x8BAD;&#x673A;&#x6784;">1.1.1 &#x57F9;&#x8BAD;&#x673A;&#x6784;</h3>
<p>&#x9996;&#x5148;&#x8BF4;&#x4E0B;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x5E94;&#x8BE5;&#x662F;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#xFF0C;&#x6211;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x662F;&#x8003;&#x7814;&#x673A;&#x6784;&#xFF0C;it&#x6280;&#x672F;&#x57F9;&#x8BAD;&#xFF0C;&#x82F1;&#x8BED;&#x8003;&#x8BD5;&#x3002;<br>&#x53C2;&#x52A0;&#x8FC7;&#x8003;&#x7814;&#x7684;&#x5B66;&#x751F;&#x5F88;&#x5927;&#x6BD4;&#x4F8B;&#x4E0A;&#x90FD;&#x62A5;&#x8FC7;&#x8003;&#x7814;&#x8F85;&#x5BFC;&#x73ED;&#xFF0C;&#x6211;&#x5728;&#x5B66;&#x6821;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x6709;n&#x4E2A;&#x8F85;&#x5BFC;&#x673A;&#x6784;<br>it&#x57F9;&#x8BAD;&#x66F4;&#x591A;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x6BD5;&#x4E1A;&#x524D;&#x81EA;&#x5DF1;&#x6216;&#x8005;&#x88AB;&#x5B66;&#x6821;&#x90FD;&#x7EC4;&#x7EC7;&#x53C2;&#x52A0;&#x8FC7;&#x57F9;&#x8BAD;<br>&#x82F1;&#x8BED;&#x57F9;&#x8BAD;&#xFF0C;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x56DB;&#x516D;&#x7EA7;&#xFF0C;&#x6258;&#x798F;&#xFF0C;&#x96C5;&#x601D;&#x8F85;&#x5BFC;<br>&#x4F46;&#x662F;&#x4ECE;&#x7F51;&#x4E0A;&#x641C;&#x4E00;&#x4E0B;&#xFF0C;&#x6CA1;&#x6709;&#x51E0;&#x4E2A;&#x673A;&#x6784;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x5355;&#x72EC;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4E00;&#x65B9;&#x9762;&#x5E94;&#x8BE5;&#x662F;&#x9700;&#x8981;&#x6210;&#x672C;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x73B0;&#x5728;&#x57F9;&#x8BAD;&#x90FD;&#x662F;&#x5730;&#x65B9;&#x6027;&#x7684;&#xFF0C;&#x62FF;&#x8003;&#x9A8C;&#x8BF4;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x8D1F;&#x8D23;&#xFF0C;&#x62A5;&#x540D;&#x4EC0;&#x4E48;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x767B;&#x8BB0;&#x8868;&#xFF0C;&#x8BFE;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x5149;&#x789F;&#x3002;</p>
<h3 id="1-1-2_&#x5B66;&#x6821;">1.1.2 &#x5B66;&#x6821;</h3>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x5B66;&#x6765;&#x8BF4;&#x505A;&#x4E2A;&#x81EA;&#x5DF1;&#x5B66;&#x6821;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8981;&#x51E0;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7684;&#x8001;&#x5E08;&#x548C;&#x540C;&#x5B66;&#xFF0C;&#x6363;&#x9F13;&#x4E00;&#x4E0B;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x5BF9;&#x5F88;&#x591A;&#x4E2D;&#x5C0F;&#x5B66;&#x6821;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x4E00;&#x4E9B;&#x7CBE;&#x529B;&#x548C;&#x8D44;&#x6E90;&#x7684;&#x3002;</p>
<h3 id="1-1-3_&#x4F01;&#x4E1A;">1.1.3 &#x4F01;&#x4E1A;</h3>
<p>&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x8981;&#x53D1;&#x5C55;&#x7684;&#x597D;&#xFF0C;&#x4EBA;&#x624D;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x516C;&#x53F8;&#x5927;&#x4E86;&#x5B8C;&#x5168;&#x62DB;&#x7684;&#x662F;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x4EBA;&#x4E0D;&#x592A;&#x73B0;&#x5B9E;&#x3002;<br>&#x62DB;&#x65B0;&#x4EBA;&#xFF0C;&#x5E26;&#x65B0;&#x4EBA;&#xFF0C;&#x50A8;&#x5907;&#x4EBA;&#x624D;&#xFF0C;&#x4E00;&#x822C;&#x516C;&#x53F8;&#x90FD;&#x4F1A;&#x505A;&#x3002;<br>&#x800C;&#x6BCF;&#x4E2A;&#x516C;&#x53F8;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;&#x6280;&#x672F;&#x6216;&#x8005;&#x529E;&#x4E8B;&#x6D41;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x4F01;&#x4E1A;&#x7684;&#x57F9;&#x8BAD;&#x5BF9;&#x4F01;&#x4E1A;&#x7684;&#x957F;&#x671F;&#x7684;&#x53D1;&#x5C55;&#x5F88;&#x91CD;&#x8981;&#x3002;<br>&#x53EF;&#x80FD;&#x76EE;&#x524D;&#x90FD;&#x662F;&#x505A;&#x70B9;&#x6587;&#x6863;&#xFF0C;&#x5F04;&#x70B9;ppt&#xFF0C;&#x5F00;&#x4E2A;&#x57F9;&#x8BAD;meeting&#x4E4B;&#x7C7B;&#x7684;&#x3002;<br>&#x8981;&#x5355;&#x72EC;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x4F01;&#x4E1A;&#x505A;&#x4E2A;&#x57F9;&#x8BAD;&#x7CFB;&#x7EDF;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<h2 id="1-2_&#x95EE;&#x9898;">1.2 &#x95EE;&#x9898;</h2>
<p>&#x5355;&#x72EC;&#x5EFA;&#x7AD9;&#x6210;&#x672C;&#x9AD8;&#xFF0C;&#x7EF4;&#x62A4;&#x66F4;&#x65B0;&#x96BE;<br>&#x5355;&#x72EC;&#x5EFA;&#x7AD9;&#x4E0D;&#x597D;&#x79EF;&#x7D2F;&#x7528;&#x6237;&#xFF0C;&#x4E0D;&#x597D;&#x63A8;&#x5E7F;</p>
<h2 id="1-3_&#x6539;&#x5584;">1.3 &#x6539;&#x5584;</h2>
<p>&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#xFF1A;</p>
<pre><code><span class="bullet">* </span>&#x4E91;&#x5E73;&#x53F0;&#xFF1A;&#x5BA2;&#x6237;&#x65E0;&#x9700;&#x6295;&#x8D44;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#xFF0C;&#x786C;&#x4EF6;
<span class="bullet">* </span>&#x5B8C;&#x5584;&#x57F9;&#x8BAD;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#xFF1A; &#x7EC4;&#x7EC7;&#x67B6;&#x6784;&#xFF0C;&#x6559;&#x5B66;&#x8BA1;&#x5212;&#x548C;&#x8BFE;&#x7A0B;&#x4F53;&#x7CFB;
<span class="bullet">* </span>&#x7075;&#x6D3B;&#x7684;&#x8BFE;&#x7A0B;&#x8BBE;&#x8BA1;&#x7BA1;&#x7406;&#xFF1A;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x5E8F;&#x5217;&#x5316;&#xFF0C;&#x8FC7;&#x7A0B;&#x5316;&#x5185;&#x5BB9;&#x7EC4;&#x7EC7;&#x3002;&#x652F;&#x6301;&#x5FAE;&#x8BFE;&#x5316;&#xFF0C;&#x79FB;&#x52A8;&#x5316;
<span class="bullet">* </span>&#x5148;&#x8FDB;&#x5168;&#x9762;&#x6559;&#x5B66;&#x5DE5;&#x5177;&#xFF1A; &#x5168;&#x7403;&#x72EC;&#x5BB6;&#x5B9E;&#x73B0;&#x624B;&#x5199;&#x516C;&#x5F0F;&#xFF0C;&#x753B;&#x56FE;&#xFF0C;&#x5728;&#x7EBF;&#x5F55;&#x5236;&#x89C6;&#x9891;&#xFF0C;&#x97F3;&#x9891;&#x7B49;&#x5728;&#x7EBF;&#x542C;&#x8BF4;&#x8BFB;&#x5199;&#x753B;&#x529F;&#x80FD;&#x3002;
<span class="bullet">* </span>&#x7B80;&#x4FBF;&#x6613;&#x7528;&#xFF1A; &#x652F;&#x6301;&#x624B;&#x673A;&#xFF0C;Pad&#xFF0C;Pc&#x5168;&#x90E8;&#x7EC8;&#x7AEF;&#x3002;&#x6CA1;&#x6709;&#x524D;&#x540E;&#x53F0;&#x533A;&#x5206;&#xFF0C;&#x89D2;&#x8272;&#x6743;&#x9650;&#x81EA;&#x52A8;&#x63A7;&#x5236;&#x3002;
<span class="bullet">* </span>&#x5B89;&#x5168;&#xFF0C;&#x7A33;&#x5B9A;&#xFF0C;&#x4EFB;&#x610F;&#x6269;&#x5C55;&#x3002;
</code></pre><p>&#x4E3B;&#x8981;&#x5BA2;&#x6237;&#x5BF9;&#x8C61;&#xFF1A;</p>
<pre><code>&#x4F01;&#x4E8B;&#x4E1A;&#x5355;&#x4F4D;&#xFF1A;&#x4F01;&#x4E8B;&#x4E1A;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#x6559;&#x80B2;&#x5E73;&#x53F0;
&#x5927;&#x4E2D;&#x4E13;&#xFF1A; &#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x5171;&#x4EAB;&#x8BFE;&#x7A0B;&#x5E73;&#x53F0;&#x548C;&#x7F51;&#x7EDC;&#x6559;&#x80B2;&#x5E73;&#x53F0;
&#x4E2D;&#x5C0F;&#x5B66;&#xFF1A; &#x6570;&#x5B57;&#x6821;&#x56ED;&#xFF0C;&#x7F51;&#x7EDC;&#x6559;&#x80B2;&#x5B9E;&#x9A8C;&#x73ED;&#xFF0C;&#x8F85;&#x52A9;&#x6559;&#x5B66;
&#x793E;&#x4F1A;&#x6559;&#x5B66;&#x673A;&#x6784;&#xFF1A;&#x72EC;&#x7ACB;&#x7F51;&#x6821;&#x6216;&#x516C;&#x5F00;&#x8BFE;
</code></pre><h1 id="&#x4E8C;&#x3001;&#x533A;&#x522B;">&#x4E8C;&#x3001;&#x533A;&#x522B;</h1>
<p>&#x4E00;&#x822C;&#x4E00;&#x4E2A;&#x65B0;&#x4EA7;&#x54C1;&#x51FA;&#x6765;&#xFF0C;&#x603B;&#x662F;&#x4F1A;&#x88AB;&#x95EE;&#x5230;&#x548C;&#x8FD9;&#x4E2A;&#x6BD4;&#xFF0C;&#x548C;&#x90A3;&#x4E2A;&#x6BD4;&#xFF0C;&#x5230;&#x5E95;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x3002;<br>&#x90A3;&#x4E48;&#x6559;&#x5B66;&#x90A6;&#x548C;&#x90A3;&#x4E48;&#x591A;&#x7684;mooc&#x7684;&#x533A;&#x522B;&#xFF0C;&#x548C;&#x65B0;&#x4E1C;&#x65B9;&#x5728;&#x7EBF;&#x7B49;&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x5730;&#x65B9;?<br>&#x533A;&#x522B;&#x5E94;&#x8BE5;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x201C;&#x4E91;&#x5E73;&#x53F0;&#x201D;&#x548C;&#x201C;&#x7EC8;&#x8EAB;&#x6559;&#x80B2;&#x201D;</p>
<p>&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x8981;&#x505A;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x7ADE;&#x4E89;&#xFF0C;&#x800C;&#x662F;&#x63A2;&#x5BFB;&#x5408;&#x4F5C;&#xFF1A;</p>
<ul>
<li>&#x767E;&#x5EA6;&#x505A;&#x7684;&#x662F;&#x641C;&#x7D22;&#x5E73;&#x53F0;&#xFF0C;&#x907F;&#x5F00;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x5927;&#x5BB6;&#x6FC0;&#x70C8;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;&#x53CD;&#x800C;&#x8BA9;&#x5404;&#x4E2A;&#x7F51;&#x7AD9;&#x4E89;&#x76F8;&#x5408;&#x4F5C;</li>
<li>&#x56E2;&#x8D2D;&#x7F51;&#x75AF;&#x8D77;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x56E2;800&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x56E2;&#x8D2D;&#x8D44;&#x6E90;&#x7684;&#x6574;&#x5408;</li>
<li>&#x56E2;&#x8D2D;&#x7F51;&#x7535;&#x5546;&#x706B;&#x7206;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x8FD4;&#x5229;&#x7F51;&#xFF0C;&#x901A;&#x8FC7;&#x505A;&#x8D44;&#x6E90;&#x6574;&#x5408;&#x3001;&#x8D2D;&#x7269;&#x94FE;&#x63A5;&#x6765;&#x4ECE;&#x4E2D;&#x76C8;&#x5229;</li>
</ul>
<h1 id="&#x4E09;&#x3001;&#x4E91;&#x670D;&#x52A1;&#x6A21;&#x5F0F;">&#x4E09;&#x3001;&#x4E91;&#x670D;&#x52A1;&#x6A21;&#x5F0F;</h1>
<p>&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x4E09;&#x7C7B;&#x670D;&#x52A1;&#x6A21;&#x5F0F;&#xFF1A;SaaS(&#x8F6F;&#x4EF6;&#x5373;&#x670D;&#x52A1;)&#x3001;PaaS(&#x5E73;&#x53F0;&#x5373;&#x670D;&#x52A1;)&#x3001;IaaS(&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5373;&#x670D;&#x52A1;)<br>&#x6559;&#x5B66;&#x90A6;&#x5C5E;&#x4E8E;SaaS&#x3002;<br>&#x7B80;&#x5355;&#x7684;&#x53EF;&#x4EE5;&#x628A;&#x6559;&#x5B66;&#x90A6;&#x770B;&#x6210;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x6821;&#x7684;&#x7F51;&#x5E97;&#xFF0C;&#x8DDF;taobao&#x4E00;&#x6837;&#x3002;<br>&#x5404;&#x79CD;&#x6559;&#x5B66;&#x673A;&#x6784;&#x53EF;&#x4EE5;&#x5728;&#x6559;&#x5B66;&#x90A6;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#xFF0C;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x7F51;&#x6821;:</p>
<ul>
<li>&#x5355;&#x72EC;&#x7684;&#x4E3B;&#x9875;</li>
<li>&#x5355;&#x72EC;&#x7684;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#xFF08;&#x5B66;&#x751F;&#xFF0C;&#x8BFE;&#x7A0B;&#x2026;&#xFF09;</li>
</ul>
<h1 id="&#x56DB;&#x3001;&#x5B9E;&#x73B0;">&#x56DB;&#x3001;&#x5B9E;&#x73B0;</h1>
<h2 id="4-1_&#x5B9E;&#x73B0;&#x6280;&#x672F;">4.1 &#x5B9E;&#x73B0;&#x6280;&#x672F;</h2>
<p>&#x73B0;&#x5728;&#x516C;&#x53F8;&#x521D;&#x521B;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x201C;&#x9AD8;&#x5927;&#x4E0A;&#x201D;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;javascript&#x5168;&#x6808;&#x5F0F;&#x5F00;&#x53D1;&#x3002;<br>node.js + AngularJS + Bootstrap<br>&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x5F00;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x5F88;&#x9177;&#x7684;&#x539F;&#x578B;&#x3002;</p>
<h2 id="4-2_&#x4E91;&#x5E73;&#x53F0;&#x642D;&#x5EFA;">4.2 &#x4E91;&#x5E73;&#x53F0;&#x642D;&#x5EFA;</h2>
<p>&#x80AF;&#x5B9A;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x642D;&#x5EFA;&#x6574;&#x4E2A;&#x4E91;&#x57FA;&#x7840;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x4E91;&#x4F9B;&#x5E94;&#x5546;&#x5DF2;&#x7ECF;&#x6BD4;&#x8F83;&#x591A;&#x3002;<br>&#x9009;&#x62E9;&#x4E91;&#x5E73;&#x53F0;&#x524D;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5F00;&#x53D1;&#x7684;&#x6280;&#x672F;</li>
<li>&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5BF9;&#x4E8E;&#x6559;&#x5B66;&#x90A6;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5E94;&#x8BE5;&#x662F;&#x4E91;&#x5B58;&#x50A8;&#xFF0C;&#x6BD4;&#x5982;&#x89C6;&#x9891;&#xFF0C;&#x97F3;&#x9891;&#xFF0C;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x7B49;</li>
<li><p>&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x80FD;&#x529B;&#xFF1A;</p>
<p>  &#x56FD;&#x5185;&#x7684;&#x767E;&#x5EA6;&#xFF0C;&#x73B0;&#x5728;&#x652F;&#x6301;node.js, &#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x914D;&#x5957;&#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x652F;&#x6301;&#xFF0C;&#x6BD4;&#x5982;&#x8F7B;&#x5E94;&#x7528;&#x548C;clouda&#x3002;<br>  &#x56FD;&#x5916;&#x7684;AWS&#xFF0C;aws&#x7684;&#x80FD;&#x529B;&#x5F3A;&#x5927;&#x662F;&#x65E0;&#x5EB8;&#x7F6E;&#x7591;&#x7684;&#xFF0C;&#x52A0;&#x4E0A;&#x73B0;&#x5728;&#x8FDB;&#x5165;&#x4E2D;&#x56FD;&#xFF0C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x6216;&#x8005;&#x88AB;&#x5899;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
</li>
</ul>
<h2 id="4-3_&#x529F;&#x80FD;&#x6A21;&#x5757;">4.3 &#x529F;&#x80FD;&#x6A21;&#x5757;</h2>
<p>&#x9664;&#x4E86;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x201C;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#x201D;&#x91CC;&#x7684;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x4E0A;&#x7684;&#x9700;&#x6C42;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#xFF1A;</p>
<h3 id="4-3-1_&#x505A;&#x7B14;&#x8BB0;">4.3.1 &#x505A;&#x7B14;&#x8BB0;</h3>
<p>&#x5BF9;&#x4E8E;&#x5B66;&#x4E60;&#x6765;&#x8BF4;&#xFF0C;&#x7B14;&#x8BB0;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x4E00;&#x6B21;&#x90FD;&#x8BB0;&#x4F4F;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x4E00;&#x4E9B;&#x91CD;&#x70B9;&#x8BB0;&#x4E0B;&#x6765;&#xFF0C;&#x53CD;&#x590D;&#x5B66;&#x4E60;&#x3002;<br>&#x7B14;&#x8BB0;&#x7684;&#x529F;&#x80FD;&#x5305;&#x62EC;&#xFF1A;<br>&#x5236;&#x4F5C;&#xFF0C;&#x6309;&#x7167;&#x9002;&#x5408;&#x8BB0;&#x5FC6;&#x7684;&#x7814;&#x7A76;&#x5206;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x7B49;<br>&#x5BFC;&#x51FA;&#xFF0C;&#x53EF;&#x4EE5;&#x5BFC;&#x51FA;&#x6210;&#x56FE;&#x7247;&#x6216;&#x8005;pdf<br>&#x53EF;&#x4EE5;&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x6D4F;&#x89C8;</p>
<h3 id="4-3-2_&#x5728;&#x7EBF;&#x505A;&#x9898;">4.3.2 &#x5728;&#x7EBF;&#x505A;&#x9898;</h3>
<p>&#x9898;&#x76EE;&#x7C7B;&#x578B;&#xFF0C;&#x9898;&#x76EE;&#x81EA;&#x52A8;&#x5224;&#x65AD;<br>&#x8003;&#x8BD5;&#xFF08;&#x5168;&#x5C4F;&#xFF0C;&#x907F;&#x514D;&#x5B66;&#x751F;&#x8003;&#x8BD5;&#x5728;&#x7F51;&#x4E0A;&#x67E5;&#x8D44;&#x6599;&#xFF09;</p>
<h3 id="4-3-3_&#x9898;&#x5E93;&#x7684;&#x5BFC;&#x5165;">4.3.3 &#x9898;&#x5E93;&#x7684;&#x5BFC;&#x5165;</h3>
<p>&#x5982;&#x4F55;&#x548C;&#x5176;&#x4ED6;&#x7F51;&#x6821;&#x5DF2;&#x7ECF;&#x6709;&#x7684;&#x9898;&#x5E93;&#x6574;&#x5408;</p>
<h1 id="&#x4E94;&#x3001;_&#x8003;&#x8651;">&#x4E94;&#x3001; &#x8003;&#x8651;</h1>
<p>&#x600E;&#x4E48;&#x533A;&#x522B;&#x4E8E;&#x5176;&#x4ED6;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x7684;&#x5E73;&#x53F0;<br>&#x5982;&#x4F55;&#x4ECE;&#x5C0F;&#x7684;&#x70B9;&#x5148;&#x505A;&#x8D77;&#x6765;&#x518D;&#x6162;&#x6162;&#x62D3;&#x5C55;&#xFF0C;&#x6BD4;&#x5982;&#x5148;&#x505A;&#x4E00;&#x4E2A;&#x793E;&#x4EA4;&#x578B;&#x7684;&#x9898;&#x5E93;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x8BB0;&#x5FC6;&#x7684;flashcards<br>&#x9762;&#x5411;&#x7684;&#x7528;&#x6237;<br>&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x7528;&#x6237;&#x7C98;&#x6027;<br>&#x6709;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x4EBA;&#x8109;&#x8D44;&#x6E90;&#xFF0C;&#x6BD4;&#x5982;&#x5B66;&#x6821;&#x6216;&#x8005;&#x76F8;&#x5173;&#x4ECE;&#x4E8B;&#x6559;&#x80B2;&#x7684;&#x4EBA;<br>&#x600E;&#x4E48;&#x6837;&#x8BA9;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4E2A;&#x4EBA;&#x4E5F;&#x80FD;&#x4ECE;&#x4E2D;&#x83B7;&#x5229;&#xFF0C;&#x6BD4;&#x5982;&#x5F00;&#x8BFE;&#x6216;&#x8005;&#x5206;&#x4EAB;<br>&#x5982;&#x679C;&#x8BF4;&#x671D;&#x7740;&#x7EC8;&#x8EAB;&#x5B66;&#x6821;&#x7684;&#x65B9;&#x5411;&#x505A;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x8003;&#x8651;&#x4E0B;&#x5B66;&#x6821;&#x4E00;&#x822C;&#x7684;&#x865A;&#x62DF;&#x573A;&#x666F;&#xFF1A;&#x6BD4;&#x5982;&#x5B66;&#x751F;&#x4F1A;&#xFF0C;&#x56FE;&#x4E66;&#x9986;&#xFF0C;&#x73ED;&#x5E72;&#xFF0C;&#x8F85;&#x5BFC;&#x5458;&#xFF0C;&#x8001;&#x5E08;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x6837;&#x5E94;&#x8BE5;&#x80FD;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x533A;&#x5206;&#x4E0E;&#x73B0;&#x6709;&#x7684;&#x5E73;&#x53F0;<br>&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x8BFE;&#x7A0B;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x6BCF;&#x5468;&#x6709;&#x4F5C;&#x4E1A;&#xFF0C;&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x8BC4;&#x6539;&#x6216;&#x5BFC;&#x5E08;&#x8BC4;&#x6539;</p>
<h1 id="&#x516D;&#x3001;&#x5E7B;&#x60F3;">&#x516D;&#x3001;&#x5E7B;&#x60F3;</h1>
<h1 id="6-1">6.1</h1>
<p>&#x5982;&#x679C;&#x505A;&#x7684;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x548C;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5B66;&#x6821;&#x5408;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8F6F;&#x786C;&#x4EF6;&#x7ED3;&#x5408;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x6837;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x6DD8;&#x6C70;&#x70B9;&#x8BFB;&#x673A;</p>
<h1 id="6-2">6.2</h1>
<p>&#x5982;&#x679C;&#x505A;&#x7684;&#x6743;&#x5A01;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x201C;&#x7EC8;&#x751F;&#x5927;&#x5B66;&#x201D;&#xFF0C;&#x5F88;&#x591A;&#x4E4B;&#x524D;&#x6CA1;&#x597D;&#x597D;&#x5B66;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#xFF0C;&#x5B66;&#x4E60;&#x5408;&#x683C;&#x4E86;&#xFF0C;&#x7528;&#x4EBA;&#x5355;&#x4F4D;&#x4E00;&#x6837;&#x8BA4;&#x53EF;</p>
<h1 id="6-3">6.3</h1>
<p>&#x5F53;&#x5B66;&#x4E60;&#x6210;&#x679C;&#xFF08;&#x6BD4;&#x5982;&#x5206;&#x6570;&#xFF09;&#x4F1A;&#x88AB;&#x4EBA;&#x8BA4;&#x53EF;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x8DEF;&#x4E0A;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x4F1A;&#x8003;&#x8651;&#x7528;&#x79FB;&#x52A8;app&#x5B66;&#x70B9;&#x4E1C;&#x897F;</p>
<h1 id="&#x4E03;&#x3001;&#x968F;&#x8BB0;">&#x4E03;&#x3001;&#x968F;&#x8BB0;</h1>
<p>&#x5144;&#x5F1F;&#x9662;&#x6821;&#xFF0C;&#x5206;&#x4EAB;&#x8D44;&#x6E90;<br>&#x505A;&#x4E2A;&#x8BBA;&#x575B;&#xFF0C;&#x5EFA;&#x7ACB;&#x6D3B;&#x8DC3;&#x751F;&#x6001;&#x5708;</p>
<h1 id="PS">PS</h1>
<p>&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x9700;&#x8981;&#x591A;&#x505A;&#x8C03;&#x67E5;&#xFF0C;&#x591A;&#x548C;&#x5B66;&#x6821;&#xFF0C;&#x591A;&#x548C;&#x540C;&#x5B66;&#x6C9F;&#x901A;&#xFF0C;&#x770B;&#x770B;&#x9875;&#x9762;&#x8BBE;&#x8BA1;&#x548C;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x4ED6;&#x4EEC;&#x7684;&#x671F;&#x671B;&#x3002;<br>&#x8054;&#x7CFB;&#x65B9;&#x5F0F;: QQ&#xFF1A; 2686576833 &#xFF0C;jack@qinjingnet.com</p>

      
    </div>
    <footer>
      
        
        
        <div class="bdsharebuttonbox"><a href="#" class="bds_more" data-cmd="more"></a><a title="分享到新浪微博" href="#" class="bds_tsina" data-cmd="tsina"></a><a title="分享到微信" href="#" class="bds_weixin" data-cmd="weixin"></a><a title="分享到QQ空间" href="#" class="bds_qzone" data-cmd="qzone"></a><a title="分享到腾讯微博" href="#" class="bds_tqq" data-cmd="tqq"></a><a title="分享到人人网" href="#" class="bds_renren" data-cmd="renren"></a></div>
        <script>window._bd_share_config={"common":{"bdSnsKey":{},"bdText":"","bdMini":"2","bdMiniList":false,"bdPic":"","bdStyle":"0","bdSize":"24"},"share":{},"image":{"viewList":["tsina","weixin","qzone","tqq","renren"],"viewText":"分享到：","viewSize":"16"},"selectShare":{"bdContainerClass":null,"bdSelectMiniList":["tsina","weixin","qzone","tqq","renren"]}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?v=89860593.js?cdnversion='+~(-new Date()/36e5)];</script>
        
<div class="prev_next clearfix">
  
    <a href="/2014/04/13/javascript系统学习-第14章/" class="alignleft prev" title="JavaScript系统学习 第14章 表单脚本">JavaScript系统学习 第14章 表单脚本</a>
  
  
    <a href="/2014/04/13/mooc-发展研究/" class="alignright next" title="MOOC 发展研究">MOOC 发展研究</a>
  
</div>

      
      <div class="clearfix"></div>
    </footer>
  </div>
</article>


<section id="comment">
  <!-- <h1 class="title">留言</h1>

  
      <div id="fb-root"></div>
<script>
  (function(d, s, id) {
    var js, fjs = d.getElementsByTagName(s)[0];
    if (d.getElementById(id)) return;
    js = d.createElement(s); js.id = id;
    js.src = "//connect.facebook.net/en_US/all.js#xfbml=1&appId=123456789012345";
    fjs.parentNode.insertBefore(js, fjs);
  }(document, 'script', 'facebook-jssdk'));
</script>

<div class="fb-comments" data-href="http://blog.gyf1.com/2014/04/13/教学邦-网校平台/" data-num-posts="5" data-width="840" data-colorscheme="light"></div>
      
   -->

  <!-- Duoshuo Comment BEGIN -->
  <div class="ds-thread"></div>
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"gyf"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = 'http://static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0] 
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
    </script>
  <!-- Duoshuo Comment END -->
</section>
</div></div>
    <aside id="sidebar" class="alignright">
  <div class="search">
  <form action="//google.com/search" method="get" accept-charset="utf-8">
    <input type="search" name="q" results="0" placeholder="搜索">
    <input type="hidden" name="q" value="site:blog.gyf1.com">
  </form>
</div>

  
<div class="widget tag">
  <h3 class="title">分类</h3>
  <ul class="entry">
  
    <li><a href="/categories/cloud/">Cloud</a><small>5</small></li>
  
    <li><a href="/categories/database/">Database</a><small>5</small></li>
  
    <li><a href="/categories/giant/">Giant</a><small>96</small></li>
  
    <li><a href="/categories/html/">HTML</a><small>9</small></li>
  
    <li><a href="/categories/innovation/">Innovation</a><small>2</small></li>
  
    <li><a href="/categories/javascript/">JavaScript</a><small>69</small></li>
  
    <li><a href="/categories/mobile/">Mobile</a><small>1</small></li>
  
    <li><a href="/categories/others/">Others</a><small>10</small></li>
  
    <li><a href="/categories/portfolio/">Portfolio</a><small>7</small></li>
  
    <li><a href="/categories/salesforce/">Salesforce</a><small>9</small></li>
  
    <li><a href="/categories/software-engineering/">Software Engineering</a><small>20</small></li>
  
    <li><a href="/categories/style/">Style</a><small>22</small></li>
  
    <li><a href="/categories/styles/">Styles</a><small>1</small></li>
  
  </ul>
</div>


  
<div class="widget tagcloud">
  <h3 class="title">标签云</h3>
  <div class="entry">
    <a href="/tags/agile-development/" style="font-size: 13.00px;">Agile Development</a><a href="/tags/android/" style="font-size: 10.00px;">Android</a><a href="/tags/angularjs/" style="font-size: 20.00px;">AngularJS</a><a href="/tags/apex/" style="font-size: 12.00px;">Apex</a><a href="/tags/bootstrap/" style="font-size: 14.00px;">Bootstrap</a><a href="/tags/bower/" style="font-size: 11.00px;">Bower</a><a href="/tags/css/" style="font-size: 18.00px;">CSS</a><a href="/tags/certification/" style="font-size: 11.00px;">Certification</a><a href="/tags/coffeescript/" style="font-size: 11.00px;">CoffeeScript</a><a href="/tags/commonjs/" style="font-size: 10.00px;">CommonJS</a><a href="/tags/compass/" style="font-size: 10.00px;">Compass</a><a href="/tags/design-pattern/" style="font-size: 15.00px;">Design Pattern</a><a href="/tags/dojo/" style="font-size: 10.00px;">Dojo</a><a href="/tags/english/" style="font-size: 11.00px;">English</a><a href="/tags/express/" style="font-size: 10.00px;">Express</a><a href="/tags/geddy/" style="font-size: 10.00px;">Geddy</a><a href="/tags/git/" style="font-size: 11.00px;">Git</a><a href="/tags/golang/" style="font-size: 10.00px;">Golang</a><a href="/tags/grunt/" style="font-size: 11.00px;">Grunt</a><a href="/tags/html5/" style="font-size: 13.00px;">HTML5</a><a href="/tags/haxe/" style="font-size: 10.00px;">Haxe</a><a href="/tags/heroku/" style="font-size: 13.00px;">Heroku</a><a href="/tags/ionic/" style="font-size: 10.00px;">Ionic</a><a href="/tags/jshint/" style="font-size: 11.00px;">JSHint</a><a href="/tags/jasmine/" style="font-size: 10.00px;">Jasmine</a><a href="/tags/karma/" style="font-size: 11.00px;">Karma</a><a href="/tags/less/" style="font-size: 10.00px;">LESS</a><a href="/tags/learning/" style="font-size: 19.00px;">Learning</a><a href="/tags/memcache/" style="font-size: 10.00px;">Memcache</a><a href="/tags/meteor/" style="font-size: 10.00px;">Meteor</a><a href="/tags/mongodb/" style="font-size: 12.00px;">MongoDB</a><a href="/tags/mongoose/" style="font-size: 11.00px;">Mongoose</a><a href="/tags/mootools/" style="font-size: 10.00px;">MooTools</a><a href="/tags/nodejs/" style="font-size: 17.00px;">Node.js</a><a href="/tags/phantomjs/" style="font-size: 10.00px;">Phantomjs</a><a href="/tags/postgres/" style="font-size: 10.00px;">Postgres</a><a href="/tags/protractor/" style="font-size: 10.00px;">Protractor</a><a href="/tags/ratchet/" style="font-size: 10.00px;">Ratchet</a><a href="/tags/redis/" style="font-size: 10.00px;">Redis</a><a href="/tags/requirejs/" style="font-size: 10.00px;">RequireJS</a><a href="/tags/riak/" style="font-size: 10.00px;">Riak</a><a href="/tags/sass/" style="font-size: 11.00px;">SASS</a><a href="/tags/stylus/" style="font-size: 10.00px;">Stylus</a><a href="/tags/teamcity/" style="font-size: 10.00px;">TeamCity</a><a href="/tags/titanium/" style="font-size: 10.00px;">Titanium</a><a href="/tags/translation/" style="font-size: 14.00px;">Translation</a><a href="/tags/ucd/" style="font-size: 10.00px;">UCD</a><a href="/tags/ued/" style="font-size: 10.00px;">UED</a><a href="/tags/visualforce/" style="font-size: 12.00px;">Visualforce</a><a href="/tags/webstorm/" style="font-size: 14.00px;">WebStorm</a><a href="/tags/yslow/" style="font-size: 10.00px;">YSlow</a><a href="/tags/yui/" style="font-size: 10.00px;">YUI</a><a href="/tags/yeoman/" style="font-size: 10.00px;">Yeoman</a><a href="/tags/jquery/" style="font-size: 16.00px;">jQuery</a>
  </div>
</div>


  
<div class="widget tag">
  <h3 class="title">最新文章</h3>
  <ul class="entry">
    
      <li>
        <a href="/2015/01/29/config-android-environment-on-mac/">config android environment on mac</a>
      </li>
    
      <li>
        <a href="/2015/01/28/iframe-not-rendering-in-ie9-mode/">iframe not rendering in ie9 mode</a>
      </li>
    
      <li>
        <a href="/2015/01/28/browser-difference-list/">browser difference list</a>
      </li>
    
      <li>
        <a href="/2015/01/28/quirks-mode-vs-standards-mode/">Quirks Mode vs Standards Mode</a>
      </li>
    
      <li>
        <a href="/2015/01/28/placeholder-in-ie9/">Placeholder in IE9</a>
      </li>
    
      <li>
        <a href="/2015/01/28/angular-apply-already-in-progress/">angular apply already in progress</a>
      </li>
    
      <li>
        <a href="/2015/01/27/video-editor-online/">video editor online</a>
      </li>
    
      <li>
        <a href="/2015/01/25/closures-in-javascript/">Closures in JavaScript</a>
      </li>
    
      <li>
        <a href="/2015/01/23/angularjs-style-guide/">AngularJS Style Guide</a>
      </li>
    
      <li>
        <a href="/2015/01/22/js-tests/">js tests</a>
      </li>
    
  </ul>
</div>


  <iframe 
	width="100%" 
	height="600" 
	class="share_self"  
	frameborder="0" 
	scrolling="no" 
	src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=0&speed=0&skin=5&isTitle=1&noborder=1&isWeibo=1&isFans=0&uid=3988939492&verifier=76ceba5c&dpc=1"
	>
</iframe>
</aside>
    <div class="clearfix"></div>
  </div>
  <footer id="footer" class="inner"><div class="alignleft">
  
  &copy; 2015 GYF1
  
</div>
<div class="clearfix"></div></footer>
  <script src="/js/jquery.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
  $('.fancybox').fancybox();
})(jQuery);
</script>


<div id="totop" style="position:fixed;bottom:150px;right:50px;cursor: pointer;">
<a title="返回顶部"><img src="/imgs/scrollup.png"/></a>
</div>
<script src="/js/totop.js"></script>

</body>
</html>